init.org

#+TITLE: Emacs config
#+AUTHOR: Kathy Barabash
#+BABEL: :cache yes
#+LATEX_HEADER: \usepackage{parskip}
#+LATEX_HEADER: \usepackage{inconsolata}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+PROPERTY: header-args :tangle yes

* About

  This is my literate Emacs configuration file created with [[http://orgmode.org][Org mode]].
This setup provides:
- self-documentation
- startup timer

** Credits
The setup is inspired by quite a few wonderful examples, most influencial are:
- [[https://github.com/larstvei/dot-emacs][larstvei]] most of the structure evntually came from here
- [[https://github.com/freetonik/emacs-dotfiles][freetonik]] inspiration came from here
- [[https://github.com/daviwil/emacs-from-scratch][daviwil]] tweaks and majic and links came from here

** How to use
  Clone the repo.
  #+BEGIN_SRC sh :tangle no
  git clone https://github.com/larstvei/dot-emacs
  #+END_SRC

  Backup your existing emacs configuration  =~/.emacs.d= and/or =~/.emacs= if necessary.
  #+BEGIN_SRC sh :tangle no
  mv ~/.emacs.d ~/.emacs.d-bak
  mv ~/.emacs ~/.emacs-bak
  #+END_SRC

  Copy the cloned repo into =~/.emacs.d=
  #+BEGIN_SRC sh :tangle no
  mv dot-emacs ~/.emacs.d
  cp ~/.emacs.d/bootsrap.el ~/.emacs.d/init.el
  #+END_SRC

  Start emacs!!!

  First run will take awile as emacs will be pulling in and installing a bunch
of packages. If first run reports errors, restart emacs. Errors that persist
need to be taken care of :-( 

** How it works

On startup, emacs invokes init.el file in located in .emacs.d directory. 
On first run, the file (copied from bootsrtap.el) contains enough configuration to cause babel to
extract proper configuration lines from init.org (this file!!!), to replace
init.el contents with the result and to restart emacs with newly created
config. On subsequent runs, emacs will use the existing init.el without
recreating and recompiling the configuration.
To modify configuration, edit this init.org (this file!). Upon saving, init.el
will be updated. The result will be seen on the next restart (more explanation follow).

** How to modify the config
   All changes to the configuration should be done in =init.org=, *not* in
   =init.el=. Any changes in the =init.el= will be overwritten by saving
   =init.org=. The =init.el= in this repo should not be tracked by git, and
   is replaced the first time Emacs is started (assuming it has been renamed
   to =~/.emacs.d=).

   Emacs can't load =.org=-files directly, but =org-mode= provides functions
   to extract the code blocks and write them to a file. There are multiple
   ways of handling this; like suggested by [[http://emacs.stackexchange.com/questions/3143/can-i-use-org-mode-to-structure-my-emacs-or-other-el-configuration-file][this StackOverflow post]], one
   could just use =org-babel-load-file=, but I had problems with
   byte-compilation. Previously I tracked both the =org.=- and =el.=-files,
   but the git commits got a little messy. So here is a new approach.

   When this configuration is loaded for the first time, the ~init.el~ is
   the file that is loaded. It looks like this:

   #+BEGIN_SRC emacs-lisp :tangle no
   ;; This file replaces itself with the actual configuration at first run.

   ;; We can't tangle without org!
   (require 'org)
   ;; Open the configuration
   (find-file (concat user-emacs-directory "init.org"))
   ;; tangle it
   (org-babel-tangle)
   ;; load it
   (load-file (concat user-emacs-directory "init.el"))
   ;; finally byte-compile it
   (byte-compile-file (concat user-emacs-directory "init.el"))
   #+END_SRC

   It tangles the org-file, so that this file is overwritten with the actual
   configuration.

   There is no reason to track the =init.el= that is generated; by running
   the following command =git= will not bother tracking it:

   #+BEGIN_SRC sh :tangle no
   git update-index --assume-unchanged init.el
   #+END_SRC

   If one wishes to make changes to the repo-version of =init.el= start
   tracking again with:

   #+BEGIN_SRC sh :tangle no
   git update-index --no-assume-unchanged init.el
   #+END_SRC

   I want lexical scoping for the init-file, which can be specified in the
   header. The first line of the configuration is as follows:

   #+BEGIN_SRC emacs-lisp
   ;;; -*- lexical-binding: t -*-
   #+END_SRC

   The =init.el= should (after the first run) mirror the source blocks in
   the =init.org=. We can use =C-c C-v t= to run =org-babel-tangle=, which
   extracts the code blocks from the current file into a source-specific
   file (in this case a =.el=-file).

   To avoid doing this each time a change is made we can add a function to
   the =after-save-hook= ensuring to always tangle and byte-compile the
   =org=-document after changes.

   #+BEGIN_SRC emacs-lisp
   (defun tangle-init ()
     "If the current buffer is 'init.org' the code-blocks are
   tangled, and the tangled file is compiled."
     (when (equal (buffer-file-name)
                  (expand-file-name (concat user-emacs-directory "init.org")))
       ;; Avoid running hooks when tangling.
       (let ((prog-mode-hook nil))
         (org-babel-tangle)
         (byte-compile-file (concat user-emacs-directory "init.el")))))

   (add-hook 'after-save-hook 'tangle-init)
   #+END_SRC

   I'd like to keep a few settings private, so we load a =private.el= if it
   exists after the init-file has loaded.

   #+BEGIN_SRC emacs-lisp
   (add-hook
    'after-init-hook
    (lambda ()
      (let ((private-file (concat user-emacs-directory "private.el")))
        (when (file-exists-p private-file)
          (load-file private-file))
        (when custom-file
          (load-file custom-file))
        (server-start))))
   #+END_SRC

   A common optimization is to temporarily disable garbage collection during
   initialization. Here, we set the ~gc-cons-threshold~ to a ridiculously large
   number, and restore the default value after initialization.

   #+BEGIN_SRC emacs-lisp
   (let ((old-gc-treshold gc-cons-threshold))
     (setq gc-cons-threshold most-positive-fixnum)
     (add-hook 'after-init-hook
               (lambda () (setq gc-cons-threshold old-gc-treshold))))
   #+END_SRC

** See how long the startup takes
Here we setup the timer, loading time will be reported in the status line.

#+begin_src emacs-lisp
(add-hook 'emacs-startup-hook
          (lambda ()
            (message "Emacs ready in %s with %d garbage collections."
                     (format "%.2f seconds"
                             (float-time
                              (time-subtract after-init-time before-init-time)))
                     gcs-done)))
#+end_src

* Configuration
** Packages

   Managing extensions for Emacs is simplified using =package= which is
   built in to Emacs 24 and newer. To load downloaded packages we need to
   initialize =package=. =cl= is a library that contains many functions from
   Common Lisp, and comes in handy quite often, so we want to make sure it's
   loaded, along with =package=, which is obviously needed.

   #+BEGIN_SRC emacs-lisp
   (require 'package)
   (package-initialize)
   #+END_SRC

   Packages can be fetched from different mirrors, [[http://melpa.milkbox.net/#/][melpa]] is the largest
   archive and is well maintained.

   #+BEGIN_SRC emacs-lisp
   (setq package-archives
         '(("gnu" . "https://elpa.gnu.org/packages/")
           ("MELPA" . "https://melpa.org/packages/"))
         package-archive-priorities
         '(("MELPA" . 5)
           ("gnu" . 0)))
   #+END_SRC

   The configuration assumes that the packages listed below are
   installed. To ensure we install missing packages if they are missing.

   #+BEGIN_SRC emacs-lisp
      (let* ((package--builtins nil)
             (packages
              '(auto-compile         ; automatically compile Emacs Lisp libraries
                company              ; Modular text completion framework
                company-coq          ; A collection of extensions PG's Coq mode
                counsel              ; Various completion functions using Ivy
                counsel-projectile   ; Ivy integration for Projectile
                define-word          ; display the definition of word at point
                diff-hl              ; Highlight uncommitted changes using VC
                doom-themes          ; An opinionated pack of modern color-themes
                expand-region        ; Increase selected region by semantic units
                focus                ; Dim color of text in surrounding sections
                golden-ratio         ; Automatic resizing windows to golden ratio
                magit                ; control Git from Emacs
                markdown-mode        ; Emacs Major mode for Markdown-formatted files
                multiple-cursors     ; Multiple cursors for Emacs
                olivetti             ; Minor mode for a nice writing environment
                org                  ; Outline-based notes management and organizer
                org-bullets          ; Show bullets in org-mode as UTF-8 characters
                paredit              ; minor mode for editing parentheses
                pdf-tools            ; Emacs support library for PDF files
                projectile           ; Manage and navigate projects in Emacs easily
                proof-general        ; A generic Emacs interface for proof assistants
                slime                ; Superior Lisp Interaction Mode for Emacs
                smex                 ; M-x interface with Ido-style fuzzy matching
                try                  ; Try out Emacs packages
                vterm                ; A terminal via libvterm
                which-key            ; Display available keybindings in popup
                )))
        (when (memq window-system '(mac ns))
          (push 'exec-path-from-shell packages)
          (push 'reveal-in-osx-finder packages))
        (let ((packages (seq-remove 'package-installed-p packages)))
          (print packages)
          (when packages
            ;; Install uninstalled packages
            (package-refresh-contents)
            (mapc 'package-install packages))))
   #+END_SRC

