init.org
** global-scale-mode

   These functions provide something close to ~text-scale-mode~, but for every
   buffer, including the minibuffer and mode line.

   #+BEGIN_SRC emacs-lisp
     (let* ((default (face-attribute 'default :height))
            (size default))

       (defun global-scale-default ()
         (interactive)
         (global-scale-internal (setq size default)))

       (defun global-scale-up ()
         (interactive)
         (global-scale-internal (setq size (+ size 20))))

       (defun global-scale-down ()
         (interactive)
         (global-scale-internal (setq size (- size 20))))

   ;  TODO-warn set-temporary-overlay-map is an obsolete function (as of 24.4); use set-transient-map instead.
       (defun global-scale-internal (arg)
         (set-face-attribute 'default (selected-frame) :height arg)
         (set-transient-map
          (let ((map (make-sparse-keymap)))
            (define-key map (kbd "C-=") 'global-scale-up)
            (define-key map (kbd "C-+") 'global-scale-up)
            (define-key map (kbd "C--") 'global-scale-down)
            (define-key map (kbd "C-0") 'global-scale-default) map))))
   #+END_SRC

* Mode specific
** Compilation

   I often run ~latexmk -pdf -pvc~ in a compilation buffer, which recompiles
   the latex-file whenever it is changed. This often results in annoyingly
   large compilation buffers; the following snippet limits the buffer size in
   accordance with ~comint-buffer-maximum-size~, which defaults to 1024 lines.

   #+BEGIN_SRC emacs-lisp
   (add-hook 'compilation-filter-hook 'comint-truncate-buffer)
   #+END_SRC

** Shell

   Inspired by [[https://github.com/torenord/.emacs.d][torenord]], I maintain quick access to shell buffers with bindings
   ~M-1~ to ~M-9~. In addition, the ~M-§~ (on an international English
   keyboard) toggles between the last visited shell, and the last visited
   non-shell buffer. The following functions facilitate this, and are bound in
   the [[Key bindings]] section.

   #+BEGIN_SRC emacs-lisp
   (let ((last-vterm ""))
     (defun toggle-vterm ()
       (interactive)
       (cond ((string-match-p "^\\vterm<[1-9][0-9]*>$" (buffer-name))
              (goto-non-vterm-buffer))
             ((get-buffer last-vterm) (switch-to-buffer last-vterm))
             (t (vterm (setq last-vterm "vterm<1>")))))

     (defun switch-vterm (n)
       (let ((buffer-name (format "vterm<%d>" n)))
         (setq last-vterm buffer-name)
         (cond ((get-buffer buffer-name)
                (switch-to-buffer buffer-name))
               (t (vterm buffer-name)
                  (rename-buffer buffer-name)))))

     (defun goto-non-vterm-buffer ()
       (let* ((r "^\\vterm<[1-9][0-9]*>$")
              (vterm-buffer-p (lambda (b) (string-match-p r (buffer-name b))))
              (non-vterms (cl-remove-if vterm-buffer-p (buffer-list))))
         (when non-vterms
           (switch-to-buffer (car non-vterms))))))
   #+END_SRC

   Don't query whether or not the ~shell~-buffer should be killed, just kill
   it.

   #+BEGIN_SRC emacs-lisp
   (defadvice vterm (after kill-with-no-query nil activate)
     (set-process-query-on-exit-flag (get-buffer-process ad-return-value) nil))
   #+END_SRC

   Use zsh:

   #+BEGIN_SRC emacs-lisp
   (setq vterm-shell "/usr/local/bin/zsh")
   #+END_SRC

   I'd like the =C-l= to work more like the standard terminal (which works
   like running =clear=), and resolve this by simply removing the
   buffer-content. Mind that this is not how =clear= works, it simply adds a
   bunch of newlines, and puts the prompt at the top of the window, so it
   does not remove anything. In Emacs removing stuff is less of a worry,
   since we can always undo!

   #+BEGIN_SRC emacs-lisp
   (defun clear-comint ()
     "Runs `comint-truncate-buffer' with the
   `comint-buffer-maximum-size' set to zero."
     (interactive)
     (let ((comint-buffer-maximum-size 0))
       (comint-truncate-buffer)))
   #+END_SRC

** Lisp

   I use =Paredit= when editing lisp code, we enable this for all lisp-modes.

   #+BEGIN_SRC emacs-lisp
   (dolist (mode '(cider-repl-mode
                   clojure-mode
                   ielm-mode
                   racket-mode
                   racket-repl-mode
                   slime-repl-mode
                   lisp-mode
                   emacs-lisp-mode
                   lisp-interaction-mode
                   scheme-mode))
     ;; add paredit-mode to all mode-hooks
     (add-hook (intern (concat (symbol-name mode) "-hook")) 'paredit-mode))
   #+END_SRC

*** Emacs Lisp

    In =emacs-lisp-mode= we can enable =eldoc-mode= to display information
    about a function or a variable in the echo area.

    #+BEGIN_SRC emacs-lisp
    (add-hook 'emacs-lisp-mode-hook 'turn-on-eldoc-mode)
    (add-hook 'lisp-interaction-mode-hook 'turn-on-eldoc-mode)
    #+END_SRC

** LaTeX and org-mode LaTeX export

   =.tex=-files should be associated with =latex-mode= instead of
   =tex-mode=.

   #+BEGIN_SRC emacs-lisp
   (add-to-list 'auto-mode-alist '("\\.tex\\'" . latex-mode))
   #+END_SRC

   Use ~biblatex~ for bibliography.

   #+BEGIN_SRC emacs-lisp
   (setq-default bibtex-dialect 'biblatex)
   #+END_SRC

   I like using the [[https://code.google.com/p/minted/][Minted]] package for source blocks in LaTeX. To make org
   use this we add the following snippet.

   #+BEGIN_SRC emacs-lisp
   (eval-after-load 'org
     '(add-to-list 'org-latex-packages-alist '("" "minted")))
   (setq org-latex-listings 'minted)
   #+END_SRC

   Use Emacs for opening the PDF file, when invoking ~C-c C-e l o~.

   #+BEGIN_SRC emacs-lisp
   (require 'org)
   (add-to-list 'org-file-apps '("\\.pdf\\'" . emacs))
   #+END_SRC

* Key bindings

  Inspired by [[http://stackoverflow.com/questions/683425/globally-override-key-binding-in-emacs][this StackOverflow post]] I keep a =custom-bindings-map= that
  holds all my custom bindings. This map can be activated by toggling a
  simple =minor-mode= that does nothing more than activating the map. This
  inhibits other =major-modes= to override these bindings. I keep this at
  the end of the init-file to make sure that all functions are actually
  defined.

  #+BEGIN_SRC emacs-lisp
  (defvar custom-bindings-map (make-keymap)
    "A keymap for custom bindings.")
  #+END_SRC

** Bindings for [[https://github.com/abo-abo/define-word][define-word]]

  #+BEGIN_SRC emacs-lisp
  (define-key custom-bindings-map (kbd "C-c D") 'define-word-at-point)
  #+END_SRC

** Bindings for [[https://github.com/magnars/expand-region.el][expand-region]]

  #+BEGIN_SRC emacs-lisp
  (define-key custom-bindings-map (kbd "C->")  'er/expand-region)
  (define-key custom-bindings-map (kbd "C-<")  'er/contract-region)
  #+END_SRC

** Bindings for [[https://github.com/magnars/multiple-cursors.el][multiple-cursors]]

  #+BEGIN_SRC emacs-lisp
  (define-key custom-bindings-map (kbd "C-c e")  'mc/edit-lines)
  (define-key custom-bindings-map (kbd "C-c a")  'mc/mark-all-like-this)
  (define-key custom-bindings-map (kbd "C-c n")  'mc/mark-next-like-this)
  #+END_SRC

** Bindings for [[https://magit.vc/][Magit]]

  #+BEGIN_SRC emacs-lisp
  (define-key custom-bindings-map (kbd "C-c m") 'magit-status)
  #+END_SRC

** Bindings for [[https://github.com/abo-abo/swiper][Counsel]]

   #+begin_src emacs-lisp
   (global-set-key (kbd "C-c i")     'swiper-isearch)
   (global-set-key (kbd "M-x")     'counsel-M-x)
   (global-set-key (kbd "C-x C-f") 'counsel-find-file)
   (global-set-key (kbd "M-y")     'counsel-yank-pop)
   (global-set-key (kbd "C-x b")   'ivy-switch-buffer)
   #+end_src

** Bindings for [[http://company-mode.github.io/][company-mode]]

  #+BEGIN_SRC emacs-lisp
  (define-key company-active-map (kbd "C-d") 'company-show-doc-buffer)
  (define-key company-active-map (kbd "C-n") 'company-select-next)
  (define-key company-active-map (kbd "C-p") 'company-select-previous)
  (define-key company-active-map (kbd "<tab>") 'company-complete)
  #+END_SRC

** Bindings for [[https://github.com/bbatsov/projectile][Projectile]]

   #+BEGIN_SRC emacs-lisp
   (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
   #+END_SRC

** Bindings for [[https://github.com/rnkn/olivetti][Olivetti]]

   #+BEGIN_SRC emacs-lisp
   (define-key custom-bindings-map (kbd "C-c o") 'olivetti-mode)
   #+END_SRC

** Bindings for built-ins

  #+BEGIN_SRC emacs-lisp
  (define-key custom-bindings-map (kbd "M-u")         'upcase-dwim)
  (define-key custom-bindings-map (kbd "M-c")         'capitalize-dwim)
  (define-key custom-bindings-map (kbd "M-l")         'downcase-dwim)
  (define-key custom-bindings-map (kbd "M-]")         'other-frame)
  (define-key custom-bindings-map (kbd "C-j")         'newline-and-indent)
  (define-key custom-bindings-map (kbd "C-c s")       'ispell-word)
  (define-key comint-mode-map     (kbd "C-l")         'clear-comint)
  #+END_SRC

